/* The string for canceling a map editing function. */
"CancelKey" = "ยกเลิก";

/* The title text in the alert when cancelling map editing. */
"CancelEditAlertTitleKey" = "คุณแน่ใจหรือไม่ว่าต้องการยกเลิก?";

/* The message text in the alert when cancelling map editing (no points created). */
"CancelEditAlertMessageKey" = "การเปลี่ยนแปลงของคุณจะไม่ถูกเก็บบันทึก";

/* The message text in the alert when cancelling map editing (points created). */
"CancelEditAlertPointsCreatedMessageKey" = "ออบเจคที่คุณสร้างขึ้นจะไม่ถูกเก็บบันทึก";

/* The text of the alert action when discarding editing changes. */
"DiscardChangesTitleKey" = "ละทิ้งการเปลี่ยนแปลง";

/* The text of the alert action when the users cancels editing an address field */
"CancelEditingTitleKey" = "ยกเลิกการแก้ไข";

/* The title text in the alert when entering an address that is invalid. */
"InvalidAddressTitleKey" = "ที่อยู่ไม่ถูกต้อง";

/* The message in the invalid address alert when an address is required. */
"AddressRequiredMessage" = "ต้องมีที่อยู่สำหรับจุดนี้";

/* The title text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationTitleKey" = "คุณไม่ได้เพิ่มตำแหน่งที่ตั้งสำหรับจุดนี้";

/* The message text in the alert when inputting empty text into a new address cell. */
"NoAddedLocationMessageKey" = "จะไม่มีการเพิ่มจุดใหม่";

/* The text of the alert action to continuing editing. */
"ContinueEditingTitleKey" = "ดำเนินการแก้ไขต่อ";

/* The title text in the alert when tapping an invalid point when trying to delete. */
"DeletePointErrorTitleKey" = "เลือกจุดที่คุณต้องการลบ";

/* The title text in the alert when trying to delete an editing point on the map, but no editing points exist. */
"EmptyDeletePointErrorTitleKey" = "ไม่มีจุดที่จะลบ";

/* The text of the alert action to dismiss the alert. */
"OKTitleKey" = "ตกลง";

/* The title text of the alert when deleting all stored editing points. */
"ClearAllPointsTitleKey" = "คุณแน่ใจหรือไม่ว่าต้องการล้างจุดทั้งหมด?";

/* The text of the alert action to reject the alert prompt. */
"NoTitleKey" = "ไม่ใช่";

/* The text of the alert action to accept the alert prompt */
"YesTitleKey" = "ใช่";

/* The title text of the alert when switching editing geometries to a point. */
"ChangeGeometryPointTitleKey" = "คุณต้องการสลับไปยังจุดหรือไม่?";

/* The title text of the alert when switching editing geometries to a polyline. */
"ChangeGeometryPolylineTitleKey" = "คุณต้องการสลับไปยัง Polyline หรือไม่?";

/* The title text of the alert when switching editing geometries to a polygon. */
"ChangeGeometryPolygonTitleKey" = "คุณต้องการสลับไปยัง Polygon หรือไม่?";

/* The message text in the alert when switching to a multipoint geometry. */
"ChangeGeometryToMultiPointMessageKey" = "จุดที่คุณเพิ่มจะไม่เปลี่ยนแปลงและคุณสามารถสร้างออบเจคต่อไปได้";

/* The message text in the alert when switching to a point geometry. */
"ChangeGeometryToPointMessageKey" = "จุดที่เพิ่มทั้งหมดของคุณจะถูกลบ";

/* The title text of the alert when deleting a point of the editing geometry. */
"DeletePointTitleKey" = "คุณแน่ใจหรือไม่ว่าต้องการลบจุดนี้?";

/* The title of the button to save the editing geometry. */
"SaveButtonTitleKey" = "เก็บบันทึก";

/* The title of the button to filter the geometry. */
"FilterTitleKey" = "ฟิลเตอร์";

/* The status text of the User Location TableViewCell in the suggesiton panel. */
"CurrentLocationKey" = "ตำแหน่งที่ตั้งปัจจุบัน";

/* The footnote text of the TableViewCell in the suggesiton panel if no suggestions are returned. */
"NoSuggestionsFoundKey" = "ไม่พบข้อเสนอแนะ";

/* The text of the editingPanel Address textField. */
"AddressKey" = "ที่อยู่";

/* The title of the button to delete all stored editing points. */
"ClearAllKey" = "ล้างทั้งหมด";

/* The text of the Toast Message after creating an object. */
"CreatedObjectToastMessage" = "สร้าง %@ ได้สำเร็จ";

/* The placeholder text of the Searchbar */
"SearchKey" = "ค้นหา";

/* The placeholder text to add a new geospatial point by tapping on the map or typing an address. */
"AddNewPointKey" = "เพิ่มจุดใหม่";

/* The title of the cell to pick from available map types. */
"BasemapKey" = "แผนที่ฐาน";

/* The title for the standard map type. */
"StandardKey" = "มาตรฐาน";

/* The title for the hybrid map type. */
"HybridKey" = "ไฮบริด";

/* The title for the hybrid flyover map type. */
"HybridFlyoverKey" = "มุมสูงแบบไฮบริด";

/* The title for the muted standard map type. */
"MutedStandardKey" = "มาตรฐานแบบปิดเสียง";

/* The title for the satellite map type. */
"SatelliteKey" = "ดาวเทียม";

/* The title for the satellite flyover map type. */
"SatelliteFlyoverKey" = "มุมสูงแบบดาวเทียม";

/* The text of add location button for location form cell. */
"AddLocationButtonKey" = "เพิ่มตำแหน่งที่ตั้ง";

